### Hypothesis Testing Exercise

### 1)      A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.


     Minitab File : Cutlets.mtw
     
  A: H0: There is no significant difference in the diameter of the two units
     H1: There is a significant difference in the diameter of the two units
     
     Here we can perform 2 sample t test as we are comparing 2 units of data.So the ouput obtained is        Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501).
     
     Drawing the inferences at 5% significance level: Now comparing the Pvalue i.e, 0.427 with the 5% significance i.e, 0.05. As the  0.472>0.05(pvalue>0.05 ) we fail to reject the null hypothesis(H0) i.e,There is no significant difference in the diameter of the two units.
     
Hence we can conclude that there is no significant difference in the diameter of the cutlet between two units.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats

In [2]:
Cutlets_data=pd.read_csv("C:\\Users\\PRIYANKA\\Downloads\\Cutlets.csv")
Cutlets_data

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [3]:
Cutlets_data.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [4]:
Unit_A=pd.Series(Cutlets_data['Unit A'])
Unit_A

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [5]:
Unit_B=pd.Series(Cutlets_data['Unit B'])
Unit_B

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [6]:
#2 sample t test
stats.ttest_ind(Unit_A,Unit_B)

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [7]:
#2 proportion t test
import statsmodels.api as sm
sm.stats.ttest_ind(Unit_A,Unit_B)

(0.7228688704677945, 0.47223947245995745, 68.0)

### 2)A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.
 
 
    Minitab File: LabTAT.mtw
  
  A: Here,From the data 
      H0:There is no significant difference in the average TAT of the reports of the laboratories on the prefered list.
      H1:There is a significant difference in the average TAT of the reports of the laboratories on the prefered list.
      
      Here we perform the ANOVA TEST as we are having 4 different samples.And the obtained output of anova test is 
      F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57).
      
      As we are caluculating at 5% significance level we compare p valuve with 0.05. When compared 2.1156708949992414e-57<0.05(pvalue<0.05).As p value is less than 0.05 we reject the null hypothesis(H0)
      
      Hence from the data we can conclude, there is a significant difference in the average TAT of the reports of the laboratories on the prefered list.

In [8]:
import pandas as pd
import numpy as np
from scipy import stats
import scipy.stats as stats

In [9]:
LabTAT_data=pd.read_csv("C:\\Users\\PRIYANKA\\Downloads\\LabTAT.csv")
LabTAT_data.head(5)

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [10]:
LabTAT_data.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [11]:
stats.f_oneway(LabTAT_data.iloc[:,0],LabTAT_data.iloc[:,1],LabTAT_data.iloc[:,2],LabTAT_data.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

### 3)Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.1)Check p-value ,2)If p-Value < alpha, we reject Null Hypothesis

     H0:ALL PROPORTIONS ARE EQUAL
     H1:NOT ALL PROPORTIONS ARE EQUAL
  
  A: Here we need to find whether there exist a relationship between 2 categorical variables.Here we need to use CHI SQUARE TEST .From the data the output obtained is 
  1)Check p-value : 0.6603094907091882
  2)If p-Value < alpha, we reject Null Hypothesis
     Here as p-value > alpha i.e,0.6603094907091882>0.05 .Hence we fail to reject the null hypothesis.

    Hence from the data we can conclude that ALL PROPORTIONS ARE EQUAL

In [12]:
BuyerRatio_data=pd.read_csv("C:\\Users\\PRIYANKA\\Downloads\\BuyerRatio (1).csv")
BuyerRatio_data

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [13]:
import pandas as pd
import numpy as np
from scipy import stats
import scipy.stats as stats

In [14]:
chisquare_prob=pd.DataFrame([[50,142,131,70],[435,1523,1356,750]],index=["Males","Females"],columns=["East","West","North","South"])
chisquare_prob

         East  West  North  South
Males      50   142    131     70
Females   435  1523   1356    750

In [15]:
stats.chi2_contingency(chisquare_prob)

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
        [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [16]:
pvalue=stats.chi2_contingency(chisquare_prob)[1]
pvalue

0.6603094907091882

### 4)TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

Minitab File: CustomerOrderForm.mtw

    A: H0:There defective percentage donot vary from centre to another center
       H1:There is a defective percentage variatin from centre to another center
    
    Firstly we use pandas to filter the data .Once the data is filtered, here we use chi square test to find the p value.The obtained pvalue is 0.2771020991233135.As 0.2771020991233135>0.05(pvalue>0.05) We fail to reject null hypothesis i.e, we accepct H0.
    
    Hence from the data ,at 5% significance The defective percentage donot vary from centre to another center

In [17]:
import pandas as pd
import numpy as np
from scipy import stats
import scipy.stats as stats

In [18]:
Costomer_OrderForm_data=pd.read_csv("C:\\Users\\PRIYANKA\\Downloads\\Costomer+OrderForm.csv")
Costomer_OrderForm_data

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [19]:
Costomer_OrderForm_data.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [20]:
Costomer_OrderForm_data.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [21]:
Costomer_OrderForm_data.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [22]:
Costomer_OrderForm_data.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [23]:
data=pd.DataFrame([[271,267,269,280],[29,33,31,20]],index=["Error Free","Defective"],columns=["Phillippines","Indonesia","Malta","India"])

In [24]:
data

            Phillippines  Indonesia  Malta  India
Error Free           271        267    269    280
Defective             29         33     31     20

In [25]:
stats.chi2_contingency(data)

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[271.75, 271.75, 271.75, 271.75],
        [ 28.25,  28.25,  28.25,  28.25]]))